MikroElektronika/core_packages/PIC/XC8/def/PIC18F8390/mcu.h
extern volatile __bit                   SEG5COM3            __at(0x7BBD);	// @ (0xF77 * 8 + 5)
#define                                 SEG5COM3_bit        _BIT_ACCESS(LCDDATA18,5)
// PORTD<SEG6>
extern volatile __bit                   SEG6                __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 SEG6_bit            _BIT_ACCESS(PORTD,6)
// LCDDATA0<SEG6COM0>
extern volatile __bit                   SEG6COM0            __at(0x7B06);	// @ (0xF60 * 8 + 6)
#define                                 SEG6COM0_bit        _BIT_ACCESS(LCDDATA0,6)
// LCDDATA6<SEG6COM1>
extern volatile __bit                   SEG6COM1            __at(0x7B36);	// @ (0xF66 * 8 + 6)
#define                                 SEG6COM1_bit        _BIT_ACCESS(LCDDATA6,6)
// LCDDATA12<SEG6COM2>
extern volatile __bit                   SEG6COM2            __at(0x7B8E);	// @ (0xF71 * 8 + 6)
#define                                 SEG6COM2_bit        _BIT_ACCESS(LCDDATA12,6)
// LCDDATA18<SEG6COM3>
extern volatile __bit                   SEG6COM3            __at(0x7BBE);	// @ (0xF77 * 8 + 6)
#define                                 SEG6COM3_bit        _BIT_ACCESS(LCDDATA18,6)
// PORTD<SEG7>
extern volatile __bit                   SEG7                __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 SEG7_bit            _BIT_ACCESS(PORTD,7)
// LCDDATA0<SEG7COM0>
extern volatile __bit                   SEG7COM0            __at(0x7B07);	// @ (0xF60 * 8 + 7)
#define                                 SEG7COM0_bit        _BIT_ACCESS(LCDDATA0,7)
// LCDDATA6<SEG7COM1>
extern volatile __bit                   SEG7COM1            __at(0x7B37);	// @ (0xF66 * 8 + 7)
#define                                 SEG7COM1_bit        _BIT_ACCESS(LCDDATA6,7)
// LCDDATA12<SEG7COM2>
extern volatile __bit                   SEG7COM2            __at(0x7B8F);	// @ (0xF71 * 8 + 7)
#define                                 SEG7COM2_bit        _BIT_ACCESS(LCDDATA12,7)
// LCDDATA18<SEG7COM3>
extern volatile __bit                   SEG7COM3            __at(0x7BBF);	// @ (0xF77 * 8 + 7)
#define                                 SEG7COM3_bit        _BIT_ACCESS(LCDDATA18,7)
// PORTB<SEG8>
extern volatile __bit                   SEG8                __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 SEG8_bit            _BIT_ACCESS(PORTB,1)
// LCDDATA1<SEG8COM0>
extern volatile __bit                   SEG8COM0            __at(0x7B08);	// @ (0xF61 * 8 + 0)
#define                                 SEG8COM0_bit        _BIT_ACCESS(LCDDATA1,0)
// LCDDATA7<SEG8COM1>
extern volatile __bit                   SEG8COM1            __at(0x7B38);	// @ (0xF67 * 8 + 0)
#define                                 SEG8COM1_bit        _BIT_ACCESS(LCDDATA7,0)
// LCDDATA13<SEG8COM2>
extern volatile __bit                   SEG8COM2            __at(0x7B90);	// @ (0xF72 * 8 + 0)
#define                                 SEG8COM2_bit        _BIT_ACCESS(LCDDATA13,0)
// LCDDATA19<SEG8COM3>
extern volatile __bit                   SEG8COM3            __at(0x7BC0);	// @ (0xF78 * 8 + 0)
#define                                 SEG8COM3_bit        _BIT_ACCESS(LCDDATA19,0)
// PORTB<SEG9>
extern volatile __bit                   SEG9                __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 SEG9_bit            _BIT_ACCESS(PORTB,2)
// LCDDATA1<SEG9COM0>
extern volatile __bit                   SEG9COM0            __at(0x7B09);	// @ (0xF61 * 8 + 1)
#define                                 SEG9COM0_bit        _BIT_ACCESS(LCDDATA1,1)
// LCDDATA7<SEG9COM1>
extern volatile __bit                   SEG9COM1            __at(0x7B39);	// @ (0xF67 * 8 + 1)
#define                                 SEG9COM1_bit        _BIT_ACCESS(LCDDATA7,1)
// LCDDATA13<SEG9COM2>
extern volatile __bit                   SEG9COM2            __at(0x7B91);	// @ (0xF72 * 8 + 1)
#define                                 SEG9COM2_bit        _BIT_ACCESS(LCDDATA13,1)
// LCDDATA19<SEG9COM3>
extern volatile __bit                   SEG9COM3            __at(0x7BC1);	// @ (0xF78 * 8 + 1)
#define                                 SEG9COM3_bit        _BIT_ACCESS(LCDDATA19,1)
// LCDSE0<SEGEN0>
extern volatile __bit                   SEGEN0              __at(0x7AD0);	// @ (0xF5A * 8 + 0)
#define                                 SEGEN0_bit          _BIT_ACCESS(LCDSE0,0)
// LCDSE0<SEGEN1>
extern volatile __bit                   SEGEN1              __at(0x7AD1);	// @ (0xF5A * 8 + 1)
#define                                 SEGEN1_bit          _BIT_ACCESS(LCDSE0,1)
// LCDSE1<SEGEN10>
extern volatile __bit                   SEGEN10             __at(0x7ADA);	// @ (0xF5B * 8 + 2)
#define                                 SEGEN10_bit         _BIT_ACCESS(LCDSE1,2)
// LCDSE1<SEGEN11>
extern volatile __bit                   SEGEN11             __at(0x7ADB);	// @ (0xF5B * 8 + 3)
#define                                 SEGEN11_bit         _BIT_ACCESS(LCDSE1,3)
// LCDSE1<SEGEN12>
extern volatile __bit                   SEGEN12             __at(0x7ADC);	// @ (0xF5B * 8 + 4)
#define                                 SEGEN12_bit         _BIT_ACCESS(LCDSE1,4)
// LCDSE1<SEGEN13>
extern volatile __bit                   SEGEN13             __at(0x7ADD);	// @ (0xF5B * 8 + 5)
#define                                 SEGEN13_bit         _BIT_ACCESS(LCDSE1,5)
// LCDSE1<SEGEN14>
extern volatile __bit                   SEGEN14             __at(0x7ADE);	// @ (0xF5B * 8 + 6)
#define                                 SEGEN14_bit         _BIT_ACCESS(LCDSE1,6)
// LCDSE1<SEGEN15>
extern volatile __bit                   SEGEN15             __at(0x7ADF);	// @ (0xF5B * 8 + 7)
#define                                 SEGEN15_bit         _BIT_ACCESS(LCDSE1,7)
// LCDSE2<SEGEN16>
extern volatile __bit                   SEGEN16             __at(0x7AE0);	// @ (0xF5C * 8 + 0)
#define                                 SEGEN16_bit         _BIT_ACCESS(LCDSE2,0)
// LCDSE2<SEGEN17>
extern volatile __bit                   SEGEN17             __at(0x7AE1);	// @ (0xF5C * 8 + 1)
#define                                 SEGEN17_bit         _BIT_ACCESS(LCDSE2,1)
// LCDSE2<SEGEN18>
extern volatile __bit                   SEGEN18             __at(0x7AE2);	// @ (0xF5C * 8 + 2)
#define                                 SEGEN18_bit         _BIT_ACCESS(LCDSE2,2)
// LCDSE2<SEGEN19>
extern volatile __bit                   SEGEN19             __at(0x7AE3);	// @ (0xF5C * 8 + 3)
#define                                 SEGEN19_bit         _BIT_ACCESS(LCDSE2,3)
// LCDSE0<SEGEN2>
extern volatile __bit                   SEGEN2              __at(0x7AD2);	// @ (0xF5A * 8 + 2)
#define                                 SEGEN2_bit          _BIT_ACCESS(LCDSE0,2)
// LCDSE2<SEGEN20>
extern volatile __bit                   SEGEN20             __at(0x7AE4);	// @ (0xF5C * 8 + 4)
#define                                 SEGEN20_bit         _BIT_ACCESS(LCDSE2,4)
// LCDSE2<SEGEN21>
extern volatile __bit                   SEGEN21             __at(0x7AE5);	// @ (0xF5C * 8 + 5)
#define                                 SEGEN21_bit         _BIT_ACCESS(LCDSE2,5)
// LCDSE2<SEGEN22>
extern volatile __bit                   SEGEN22             __at(0x7AE6);	// @ (0xF5C * 8 + 6)
#define                                 SEGEN22_bit         _BIT_ACCESS(LCDSE2,6)
// LCDSE2<SEGEN23>
extern volatile __bit                   SEGEN23             __at(0x7AE7);	// @ (0xF5C * 8 + 7)
#define                                 SEGEN23_bit         _BIT_ACCESS(LCDSE2,7)
// LCDSE3<SEGEN24>
extern volatile __bit                   SEGEN24             __at(0x7AE8);	// @ (0xF5D * 8 + 0)
#define                                 SEGEN24_bit         _BIT_ACCESS(LCDSE3,0)
// LCDSE3<SEGEN25>
extern volatile __bit                   SEGEN25             __at(0x7AE9);	// @ (0xF5D * 8 + 1)
#define                                 SEGEN25_bit         _BIT_ACCESS(LCDSE3,1)
// LCDSE3<SEGEN26>
extern volatile __bit                   SEGEN26             __at(0x7AEA);	// @ (0xF5D * 8 + 2)
#define                                 SEGEN26_bit         _BIT_ACCESS(LCDSE3,2)
// LCDSE3<SEGEN27>
extern volatile __bit                   SEGEN27             __at(0x7AEB);	// @ (0xF5D * 8 + 3)
#define                                 SEGEN27_bit         _BIT_ACCESS(LCDSE3,3)
// LCDSE3<SEGEN28>
extern volatile __bit                   SEGEN28             __at(0x7AEC);	// @ (0xF5D * 8 + 4)
#define                                 SEGEN28_bit         _BIT_ACCESS(LCDSE3,4)
// LCDSE3<SEGEN29>
extern volatile __bit                   SEGEN29             __at(0x7AED);	// @ (0xF5D * 8 + 5)
#define                                 SEGEN29_bit         _BIT_ACCESS(LCDSE3,5)
// LCDSE0<SEGEN3>
extern volatile __bit                   SEGEN3              __at(0x7AD3);	// @ (0xF5A * 8 + 3)
#define                                 SEGEN3_bit          _BIT_ACCESS(LCDSE0,3)
// LCDSE3<SEGEN30>
extern volatile __bit                   SEGEN30             __at(0x7AEE);	// @ (0xF5D * 8 + 6)
#define                                 SEGEN30_bit         _BIT_ACCESS(LCDSE3,6)
// LCDSE3<SEGEN31>
extern volatile __bit                   SEGEN31             __at(0x7AEF);	// @ (0xF5D * 8 + 7)
#define                                 SEGEN31_bit         _BIT_ACCESS(LCDSE3,7)
// LCDSE4<SEGEN32>
extern volatile __bit                   SEGEN32             __at(0x7AF0);	// @ (0xF5E * 8 + 0)
#define                                 SEGEN32_bit         _BIT_ACCESS(LCDSE4,0)
// LCDSE4<SEGEN33>
extern volatile __bit                   SEGEN33             __at(0x7AF1);	// @ (0xF5E * 8 + 1)
#define                                 SEGEN33_bit         _BIT_ACCESS(LCDSE4,1)
// LCDSE4<SEGEN34>
extern volatile __bit                   SEGEN34             __at(0x7AF2);	// @ (0xF5E * 8 + 2)
#define                                 SEGEN34_bit         _BIT_ACCESS(LCDSE4,2)
// LCDSE4<SEGEN35>
extern volatile __bit                   SEGEN35             __at(0x7AF3);	// @ (0xF5E * 8 + 3)
#define                                 SEGEN35_bit         _BIT_ACCESS(LCDSE4,3)
// LCDSE4<SEGEN36>
extern volatile __bit                   SEGEN36             __at(0x7AF4);	// @ (0xF5E * 8 + 4)
#define                                 SEGEN36_bit         _BIT_ACCESS(LCDSE4,4)
// LCDSE4<SEGEN37>
extern volatile __bit                   SEGEN37             __at(0x7AF5);	// @ (0xF5E * 8 + 5)
#define                                 SEGEN37_bit         _BIT_ACCESS(LCDSE4,5)
// LCDSE4<SEGEN38>
extern volatile __bit                   SEGEN38             __at(0x7AF6);	// @ (0xF5E * 8 + 6)
#define                                 SEGEN38_bit         _BIT_ACCESS(LCDSE4,6)
// LCDSE4<SEGEN39>
extern volatile __bit                   SEGEN39             __at(0x7AF7);	// @ (0xF5E * 8 + 7)
#define                                 SEGEN39_bit         _BIT_ACCESS(LCDSE4,7)
// LCDSE0<SEGEN4>
extern volatile __bit                   SEGEN4              __at(0x7AD4);	// @ (0xF5A * 8 + 4)
#define                                 SEGEN4_bit          _BIT_ACCESS(LCDSE0,4)
// LCDSE5<SEGEN40>
extern volatile __bit                   SEGEN40             __at(0x7AF8);	// @ (0xF5F * 8 + 0)
#define                                 SEGEN40_bit         _BIT_ACCESS(LCDSE5,0)
// LCDSE5<SEGEN41>
extern volatile __bit                   SEGEN41             __at(0x7AF9);	// @ (0xF5F * 8 + 1)
#define                                 SEGEN41_bit         _BIT_ACCESS(LCDSE5,1)
// LCDSE5<SEGEN42>
extern volatile __bit                   SEGEN42             __at(0x7AFA);	// @ (0xF5F * 8 + 2)
#define                                 SEGEN42_bit         _BIT_ACCESS(LCDSE5,2)
// LCDSE5<SEGEN43>
extern volatile __bit                   SEGEN43             __at(0x7AFB);	// @ (0xF5F * 8 + 3)
#define                                 SEGEN43_bit         _BIT_ACCESS(LCDSE5,3)
// LCDSE5<SEGEN44>
extern volatile __bit                   SEGEN44             __at(0x7AFC);	// @ (0xF5F * 8 + 4)
#define                                 SEGEN44_bit         _BIT_ACCESS(LCDSE5,4)
// LCDSE5<SEGEN45>
extern volatile __bit                   SEGEN45             __at(0x7AFD);	// @ (0xF5F * 8 + 5)
#define                                 SEGEN45_bit         _BIT_ACCESS(LCDSE5,5)
// LCDSE5<SEGEN46>
extern volatile __bit                   SEGEN46             __at(0x7AFE);	// @ (0xF5F * 8 + 6)
#define                                 SEGEN46_bit         _BIT_ACCESS(LCDSE5,6)
// LCDSE5<SEGEN47>
extern volatile __bit                   SEGEN47             __at(0x7AFF);	// @ (0xF5F * 8 + 7)
#define                                 SEGEN47_bit         _BIT_ACCESS(LCDSE5,7)
// LCDSE0<SEGEN5>
extern volatile __bit                   SEGEN5              __at(0x7AD5);	// @ (0xF5A * 8 + 5)
#define                                 SEGEN5_bit          _BIT_ACCESS(LCDSE0,5)
// LCDSE0<SEGEN6>
extern volatile __bit                   SEGEN6              __at(0x7AD6);	// @ (0xF5A * 8 + 6)
#define                                 SEGEN6_bit          _BIT_ACCESS(LCDSE0,6)
// LCDSE0<SEGEN7>
extern volatile __bit                   SEGEN7              __at(0x7AD7);	// @ (0xF5A * 8 + 7)
#define                                 SEGEN7_bit          _BIT_ACCESS(LCDSE0,7)
// LCDSE1<SEGEN8>
extern volatile __bit                   SEGEN8              __at(0x7AD8);	// @ (0xF5B * 8 + 0)
#define                                 SEGEN8_bit          _BIT_ACCESS(LCDSE1,0)
// LCDSE1<SEGEN9>
extern volatile __bit                   SEGEN9              __at(0x7AD9);	// @ (0xF5B * 8 + 1)
#define                                 SEGEN9_bit          _BIT_ACCESS(LCDSE1,1)
// SSPCON2<SEN>
extern volatile __bit                   SEN                 __at(0x7E28);	// @ (0xFC5 * 8 + 0)
#define                                 SEN_bit             _BIT_ACCESS(SSPCON2,0)
// TXSTA1<SENDB>
extern volatile __bit                   SENDB               __at(0x7D63);	// @ (0xFAC * 8 + 3)
#define                                 SENDB_bit           _BIT_ACCESS(TXSTA1,3)
// TXSTA1<SENDB1>
extern volatile __bit                   SENDB1              __at(0x7D63);	// @ (0xFAC * 8 + 3)
#define                                 SENDB1_bit          _BIT_ACCESS(TXSTA1,3)
// TXSTA2<SENDB2>
extern volatile __bit                   SENDB2              __at(0x7B63);	// @ (0xF6C * 8 + 3)
#define                                 SENDB2_bit          _BIT_ACCESS(TXSTA2,3)
// LCDCON<SLPEN>
extern volatile __bit                   SLPEN               __at(0x7ACE);	// @ (0xF59 * 8 + 6)
#define                                 SLPEN_bit           _BIT_ACCESS(LCDCON,6)
// SSPSTAT<SMP>
extern volatile __bit                   SMP                 __at(0x7E3F);	// @ (0xFC7 * 8 + 7)
#define                                 SMP_bit             _BIT_ACCESS(SSPSTAT,7)
// T1CON<SOSCEN>
extern volatile __bit                   SOSCEN              __at(0x7E6B);	// @ (0xFCD * 8 + 3)
#define                                 SOSCEN_bit          _BIT_ACCESS(T1CON,3)
// T3CON<SOSCEN3>
extern volatile __bit                   SOSCEN3             __at(0x7D8B);	// @ (0xFB1 * 8 + 3)
#define                                 SOSCEN3_bit         _BIT_ACCESS(T3CON,3)
// RCSTA1<SPEN>
extern volatile __bit _DEPRECATED       SPEN                __at(0x7D5F);	// @ (0xFAB * 8 + 7)
#define                                 SPEN_bit            _BIT_ACCESS(RCSTA1,7)
// RCSTA1<SPEN1>
extern volatile __bit                   SPEN1               __at(0x7D5F);	// @ (0xFAB * 8 + 7)
#define                                 SPEN1_bit           _BIT_ACCESS(RCSTA1,7)
// RCSTA2<SPEN2>
extern volatile __bit                   SPEN2               __at(0x7B5F);	// @ (0xF6B * 8 + 7)
#define                                 SPEN2_bit           _BIT_ACCESS(RCSTA2,7)
// RCSTA1<SREN>
extern volatile __bit _DEPRECATED       SREN                __at(0x7D5D);	// @ (0xFAB * 8 + 5)
#define                                 SREN_bit            _BIT_ACCESS(RCSTA1,5)
// RCSTA1<SREN1>
extern volatile __bit                   SREN1               __at(0x7D5D);	// @ (0xFAB * 8 + 5)
#define                                 SREN1_bit           _BIT_ACCESS(RCSTA1,5)
// RCSTA2<SREN2>
extern volatile __bit                   SREN2               __at(0x7B5D);	// @ (0xF6B * 8 + 5)
#define                                 SREN2_bit           _BIT_ACCESS(RCSTA2,5)
// RCSTA1<SRENA>
extern volatile __bit                   SRENA               __at(0x7D5D);	// @ (0xFAB * 8 + 5)
#define                                 SRENA_bit           _BIT_ACCESS(RCSTA1,5)
// PORTF<SS>
extern volatile __bit                   SS                  __at(0x7C2F);	// @ (0xF85 * 8 + 7)
#define                                 SS_bit              _BIT_ACCESS(PORTF,7)
// PORTD<SS2>
extern volatile __bit                   SS2                 __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 SS2_bit             _BIT_ACCESS(PORTD,7)
// SSPCON1<SSPEN>
extern volatile __bit                   SSPEN               __at(0x7E35);	// @ (0xFC6 * 8 + 5)
#define                                 SSPEN_bit           _BIT_ACCESS(SSPCON1,5)
// PIE1<SSPIE>
extern volatile __bit                   SSPIE               __at(0x7CEB);	// @ (0xF9D * 8 + 3)
#define                                 SSPIE_bit           _BIT_ACCESS(PIE1,3)
// PIR1<SSPIF>
extern volatile __bit                   SSPIF               __at(0x7CF3);	// @ (0xF9E * 8 + 3)
#define                                 SSPIF_bit           _BIT_ACCESS(PIR1,3)
// IPR1<SSPIP>
extern volatile __bit                   SSPIP               __at(0x7CFB);	// @ (0xF9F * 8 + 3)
#define                                 SSPIP_bit           _BIT_ACCESS(IPR1,3)
// SSPCON1<SSPM0>
extern volatile __bit                   SSPM0               __at(0x7E30);	// @ (0xFC6 * 8 + 0)
#define                                 SSPM0_bit           _BIT_ACCESS(SSPCON1,0)
// LCDDATA12<SSPM012>
extern volatile __bit                   SSPM012             __at(0x7B88);	// @ (0xF71 * 8 + 0)
#define                                 SSPM012_bit         _BIT_ACCESS(LCDDATA12,0)
// SSPCON1<SSPM1>
extern volatile __bit                   SSPM1               __at(0x7E31);	// @ (0xFC6 * 8 + 1)
#define                                 SSPM1_bit           _BIT_ACCESS(SSPCON1,1)
// LCDDATA12<SSPM112>
extern volatile __bit                   SSPM112             __at(0x7B89);	// @ (0xF71 * 8 + 1)
#define                                 SSPM112_bit         _BIT_ACCESS(LCDDATA12,1)
// SSPCON1<SSPM2>
extern volatile __bit                   SSPM2               __at(0x7E32);	// @ (0xFC6 * 8 + 2)
#define                                 SSPM2_bit           _BIT_ACCESS(SSPCON1,2)
// LCDDATA12<SSPM212>
extern volatile __bit                   SSPM212             __at(0x7B8A);	// @ (0xF71 * 8 + 2)
#define                                 SSPM212_bit         _BIT_ACCESS(LCDDATA12,2)
// SSPCON1<SSPM3>
extern volatile __bit                   SSPM3               __at(0x7E33);	// @ (0xFC6 * 8 + 3)
#define                                 SSPM3_bit           _BIT_ACCESS(SSPCON1,3)
// LCDDATA12<SSPM312>
extern volatile __bit                   SSPM312             __at(0x7B8B);	// @ (0xF71 * 8 + 3)
#define                                 SSPM312_bit         _BIT_ACCESS(LCDDATA12,3)
// SSPCON1<SSPOV>
extern volatile __bit                   SSPOV               __at(0x7E36);	// @ (0xFC6 * 8 + 6)
#define                                 SSPOV_bit           _BIT_ACCESS(SSPCON1,6)
// SSPSTAT<START>
extern volatile __bit                   START               __at(0x7E3B);	// @ (0xFC7 * 8 + 3)
#define                                 START_bit           _BIT_ACCESS(SSPSTAT,3)
// STKPTR<STKFUL>
extern volatile __bit                   STKFUL              __at(0x7FE7);	// @ (0xFFC * 8 + 7)
#define                                 STKFUL_bit          _BIT_ACCESS(STKPTR,7)
// STKPTR<STKOVF>
extern volatile __bit                   STKOVF              __at(0x7FE7);	// @ (0xFFC * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(STKPTR,7)
// STKPTR<STKPTR0>
extern volatile __bit                   STKPTR0             __at(0x7FE0);	// @ (0xFFC * 8 + 0)
#define                                 STKPTR0_bit         _BIT_ACCESS(STKPTR,0)
// STKPTR<STKPTR1>
extern volatile __bit                   STKPTR1             __at(0x7FE1);	// @ (0xFFC * 8 + 1)
#define                                 STKPTR1_bit         _BIT_ACCESS(STKPTR,1)
// STKPTR<STKPTR2>
extern volatile __bit                   STKPTR2             __at(0x7FE2);	// @ (0xFFC * 8 + 2)
#define                                 STKPTR2_bit         _BIT_ACCESS(STKPTR,2)
// STKPTR<STKPTR3>
extern volatile __bit                   STKPTR3             __at(0x7FE3);	// @ (0xFFC * 8 + 3)
#define                                 STKPTR3_bit         _BIT_ACCESS(STKPTR,3)
// STKPTR<STKPTR4>
extern volatile __bit                   STKPTR4             __at(0x7FE4);	// @ (0xFFC * 8 + 4)
#define                                 STKPTR4_bit         _BIT_ACCESS(STKPTR,4)
// STKPTR<STKUNF>
extern volatile __bit                   STKUNF              __at(0x7FE6);	// @ (0xFFC * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(STKPTR,6)
// SSPSTAT<STOP>
extern volatile __bit                   STOP                __at(0x7E3C);	// @ (0xFC7 * 8 + 4)
#define                                 STOP_bit            _BIT_ACCESS(SSPSTAT,4)
// WDTCON<SWDTE>
extern volatile __bit                   SWDTE               __at(0x7E88);	// @ (0xFD1 * 8 + 0)
#define                                 SWDTE_bit           _BIT_ACCESS(WDTCON,0)
// WDTCON<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x7E88);	// @ (0xFD1 * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON,0)
// TXSTA1<SYNC>
extern volatile __bit _DEPRECATED       SYNC                __at(0x7D64);	// @ (0xFAC * 8 + 4)
#define                                 SYNC_bit            _BIT_ACCESS(TXSTA1,4)
// TXSTA1<SYNC1>
extern volatile __bit                   SYNC1               __at(0x7D64);	// @ (0xFAC * 8 + 4)
#define                                 SYNC1_bit           _BIT_ACCESS(TXSTA1,4)
// TXSTA2<SYNC2>
extern volatile __bit                   SYNC2               __at(0x7B64);	// @ (0xF6C * 8 + 4)
#define                                 SYNC2_bit           _BIT_ACCESS(TXSTA2,4)
// T0CON<T08BIT>
extern volatile __bit                   T08BIT              __at(0x7EAE);	// @ (0xFD5 * 8 + 6)
#define                                 T08BIT_bit          _BIT_ACCESS(T0CON,6)
// PORTA<T0CKI>
extern volatile __bit                   T0CKI               __at(0x7C04);	// @ (0xF80 * 8 + 4)
#define                                 T0CKI_bit           _BIT_ACCESS(PORTA,4)
// T0CON<T0CS>
extern volatile __bit                   T0CS                __at(0x7EAD);	// @ (0xFD5 * 8 + 5)
#define                                 T0CS_bit            _BIT_ACCESS(T0CON,5)
// INTCON<T0IE>
extern volatile __bit                   T0IE                __at(0x7F95);	// @ (0xFF2 * 8 + 5)
#define                                 T0IE_bit            _BIT_ACCESS(INTCON,5)
// INTCON<T0IF>
extern volatile __bit                   T0IF                __at(0x7F92);	// @ (0xFF2 * 8 + 2)
#define                                 T0IF_bit            _BIT_ACCESS(INTCON,2)
// INTCON2<T0IP>
extern volatile __bit                   T0IP                __at(0x7F8A);	// @ (0xFF1 * 8 + 2)
#define                                 T0IP_bit            _BIT_ACCESS(INTCON2,2)
// T0CON<T0PS0>
extern volatile __bit                   T0PS0               __at(0x7EA8);	// @ (0xFD5 * 8 + 0)
#define                                 T0PS0_bit           _BIT_ACCESS(T0CON,0)
// T0CON<T0PS1>
extern volatile __bit                   T0PS1               __at(0x7EA9);	// @ (0xFD5 * 8 + 1)
#define                                 T0PS1_bit           _BIT_ACCESS(T0CON,1)
// T0CON<T0PS2>
extern volatile __bit                   T0PS2               __at(0x7EAA);	// @ (0xFD5 * 8 + 2)
